app/views/employee/charts.html.erb

    		<h1>Realassets by days</h1>
	         <%= line_chart Realasset.group_by_day(:created_at).count %>
---
SELECT COUNT(*) AS count_all, DATE_TRUNC('day', "created_at"::timestamptz AT TIME ZONE 'Etc/UTC') AT TIME ZONE 'Etc/UTC' AS day FROM "realassets" GROUP BY DATE_TRUNC('day', "created_at"::timestamptz AT TIME ZONE 'Etc/UTC') AT TIME ZONE 'Etc/UTC'

        <h1>vendors by day</h1>
          <%= line_chart Vendor.group_by_day(:created_at).count%>
---
SELECT COUNT(*) AS count_all, DATE_TRUNC('day', "created_at"::timestamptz AT TIME ZONE 'Etc/UTC') AT TIME ZONE 'Etc/UTC' AS day FROM "vendors" GROUP BY DATE_TRUNC('day', "created_at"::timestamptz AT TIME ZONE 'Etc/UTC') AT TIME ZONE 'Etc/UTC'

        <h1>Pi chart of all the Datas</h1>
          <%= pie_chart({"Asset" => Realasset.count , "Requisition" => Requisition.count, "Vendor" => Vendor.count , "Location" => Location.count , "Employee" => Emp.count , "Authorize" => Authorize.count , "hr" =>Hr.count , "Purchase order" => Po.count}) %>
---
SELECT COUNT(*) FROM "authorizes"
SELECT COUNT(*) FROM "emps"
SELECT COUNT(*) FROM "locations"
SELECT COUNT(*) FROM "requisitions" WHERE "requisitions"."emp_id" = $1  [["emp_id", 2]]