app/views/employee/eform.html.erb

SELECT "poapps".* FROM "poapps" WHERE "poapps"."po_id" = $1  [["po_id", 10]]
---

         <% p.poapps.each do |r| %>