app/views/auth/po.html.erb

                                                    <td><%= p.podate %></td>
                                                      <% p.poapps.each do |ap| %>
---
SELECT "poapps".* FROM "poapps" WHERE "poapps"."po_id" = $1  [["po_id", 2]]

                                                      </td>
                                                      <% p.ssends.each do |j| %>
---
SELECT "ssends".* FROM "ssends" WHERE "ssends"."po_id" = $1  [["po_id", 2]]