app/views/stocks/index.html.erb

                                   		<td>
                                            <%if s.allots.empty? %>
---
SELECT 1 AS one FROM "allots" WHERE "allots"."stock_id" = $1 LIMIT 1  [["stock_id", 6]]