app/views/pos/_index.html.erb

       <td>
        <%if r.poapps.empty? %>
---
SELECT 1 AS one FROM "poapps" WHERE "poapps"."po_id" = $1 LIMIT 1  [["po_id", 6]]