app/views/pos/index.html.erb

SELECT "poapps".* FROM "poapps" WHERE "poapps"."po_id" = $1  [["po_id", 6]]
SELECT 1 AS one FROM "poapps" WHERE "poapps"."po_id" = $1 LIMIT 1  [["po_id", 6]]
---
       <td> <%= r.vadd %></td>
       <% if r.poapps.empty? %>