app/controllers/allots_controller.rb

  def create
  	@allot = Allot.new(params[:allot])
  	if @allot.save
---
INSERT INTO "allots" ("created_at", "stock_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 03 May 2014 15:36:19 UTC +00:00], ["stock_id", 14], ["updated_at", Sat, 03 May 2014 15:36:19 UTC +00:00]]

  def index
     @stock = Stock.joins(:allots).where('allots.stock_id IS NOT NULL')
---
SELECT "stocks".* FROM "stocks" INNER JOIN "allots" ON "allots"."stock_id" = "stocks"."id" WHERE (allots.stock_id IS NOT NULL)