app/controllers/auth_controller.rb

  def po
    @emp = Emp.all
---
SELECT "emps".* FROM "emps"