app/controllers/employee_controller.rb

SELECT "emps".* FROM "emps" WHERE "emps"."id" = 2 ORDER BY "emps"."id" ASC LIMIT 1
SELECT "requisitions".* FROM "requisitions" WHERE "requisitions"."emp_id" = $1  [["emp_id", 2]]
---
 def eform
 @emp = Emp.find(current_emp.id).requisitions

SELECT "emps".* FROM "emps" WHERE "emps"."id" = 2 ORDER BY "emps"."id" ASC LIMIT 1
---
 def charts
 	@emp = Emp.find(current_emp.id).requisitions