app/controllers/emps_controller.rb

  def show
  	@emp = Emp.find(params[:id])
---
SELECT "emps".* FROM "emps" WHERE "emps"."id" = $1 LIMIT 1  [["id", "7"]]