app/controllers/invards_controller.rb

INSERT INTO "invards" ("created_at", "invoice", "remark", "ssend_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 29 Apr 2014 20:38:21 UTC +00:00], ["invoice", "THUG372"], ["remark", ""], ["ssend_id", 2], ["updated_at", Tue, 29 Apr 2014 20:38:21 UTC +00:00]]
---
  def create
  	@invard = Invard.new(params[:invard])
  	if @invard.save