app/controllers/locations_controller.rb

  def index
    @location = Location.all
---
SELECT "locations".* FROM "locations"

  def create
     @location = Location.new(params[:location])
        if @location.save
---
INSERT INTO "locations" ("created_at", "location", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 03 May 2014 08:24:46 UTC +00:00], ["location", "admin"], ["updated_at", Sat, 03 May 2014 08:24:46 UTC +00:00]]