app/controllers/poapps_controller.rb

INSERT INTO "poapps" ("action", "created_at", "date", "from", "invoice", "po_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
  	@poapp = Poapp.new(params[:poapp])
			if @poapp.save

SELECT "poapps"."invoice", "poapps"."from" FROM "poapps" WHERE "poapps"."action" = 'approve'
---
  def index
    @poapp = Poapp.all

    @poapps =  Poapp.where(action: 'approve').pluck( :invoice , :from)