app/controllers/realassets_controller.rb

    def index
      @realasset = Realasset.all
      @realasset = Realasset.order("id DESC").page(params[:page]).per(5)
---
SELECT "realassets".* FROM "realassets" ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "realassets"