app/controllers/requisitions_controller.rb

  def create
    @requisition = Requisition.new(params[:requisition])
    if @requisition.save
---
INSERT INTO "requisitions" ("cost", "created_at", "emp_id", "from", "name", "particular", "quantity", "total", "unit", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def show
      @requisition = Requisition.find(params[:id])
---
SELECT "requisitions".* FROM "requisitions" WHERE "requisitions"."id" = $1 LIMIT 1  [["id", "21"]]

  def index
      @requisition = Requisition.all
      @requisition = Requisition.order("id DESC").page(params[:page]).per(5)
---
SELECT "requisitions".* FROM "requisitions" ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "requisitions"