app/controllers/ssends_controller.rb

SELECT "ssends".* FROM "ssends" WHERE "ssends"."id" = $1 LIMIT 1  [["id", "16"]]
---
  def show

    @ssend = Ssend.find(params[:id])