app/controllers/stocks_controller.rb

  def create
  	@stock = Stock.new(params[:stock])
  		if @stock.save
---
INSERT INTO "stocks" ("created_at", "invoice", "name", "requ", "sendto", "ssend_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def index
  	@stock = Stock.all
---
SELECT "stocks".* FROM "stocks"