app/controllers/vendors_controller.rb

SELECT "vendors".* FROM "vendors" ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "vendors"
---
  def index
		@title = "All users"
		@vendor= Vendor.all
		 @vendor = Vendor.order("id DESC").page(params[:page]).per(5)