app/views/emps/show.html.erb


<% @emp.requisitions.each do |x| %>
---
SELECT "requisitions".* FROM "requisitions" WHERE "requisitions"."emp_id" = $1  [["emp_id", 4]]


         <% p.poapps.each do |r| %>
---
SELECT "poapps".* FROM "poapps" WHERE "poapps"."po_id" = $1  [["po_id", 7]]